SLS/src/Catalogs/jiraШаблонДляНовыхЗадач/jiraШаблонДляНовыхЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>jiraШаблонДляНовыхЗадач</name>
  <attributes>
    <name>ШаблонJSON</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.jiraПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапроса</name>
    <type>
      <types>CatalogRef.jiraТипыЗапросов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.jiraСтатусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.jiraПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.jiraПользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыШаблона</name>
    <attributes>
      <name>СтрокаЗамены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SLS/src/Catalogs/jiraШаблонДляНовыхЗадач/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПерезаполнитьПараметрыПоШаблону(Отказ);
	
КонецПроцедуры

Процедура ПерезаполнитьПараметрыПоШаблону(Отказ)
	
	Для Каждого СтрокаПараметра ИЗ ПараметрыШаблона Цикл
		СтрокаПараметра.Используется = Ложь;
	КонецЦикла;
	
	НачПоз = 0;
	КонПоз = 0;
	
	НачПоз = СтрНайти(ШаблонJSON, "%");
	Пока НачПоз > 0 Цикл
		
		КонПоз = СтрНайти(ШаблонJSON, "%",, НачПоз+1);
		Если КонПоз = 0 Тогда
			Отказ = Истина;
			Сообщить("Нечётное количество символов ""%"" в шаблоне");
			Возврат;
		КонецЕсли;
		
		ИмяВШаблоне = Сред(ШаблонJSON, НачПоз+1, КонПоз - НачПоз-1);
		Если СтрЧислоСтрок(ИмяВШаблоне) > 1 Тогда
			Отказ = Истина;
			Сообщить("ИмяПараметра не может содержать переносы строк! (" + НачПоз + " симв.)");
			Возврат;
		КонецЕсли;
		
		Если СтрДлина(ИмяВШаблоне) > 150 Тогда
			Отказ = Истина;
			Сообщить("ИмяПараметра не может быть больше 150 символов: """ + ИмяВШаблоне + """");
			Возврат;
		КонецЕсли;
		
		СтрокаПараметра = ПараметрыШаблона.Найти(ИмяВШаблоне, "СтрокаЗамены");
		Если СтрокаПараметра = Неопределено Тогда
			СтрокаПараметра = ПараметрыШаблона.Добавить();
			СтрокаПараметра.СтрокаЗамены = ИмяВШаблоне;
		КонецЕсли;
		
		СтрокаПараметра.Используется = Истина;
		
		НачПоз = СтрНайти(ШаблонJSON, "%",, КонПоз+1);
		
	КонецЦикла;
	
КонецПроцедуры


#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
